app/views/dashboard/index.html.erb


        <% if incident.services.any? %>
---
SELECT 1 AS one FROM "services" INNER JOIN "incident_services" ON "services"."id" = "incident_services"."service_id" WHERE "incident_services"."incident_id" = 1 LIMIT 1

            <span>Affected Services:</span>
            <% incident.services.each do |s| %>
---
SELECT "services".* FROM "services" INNER JOIN "incident_services" ON "services"."id" = "incident_services"."service_id" WHERE "incident_services"."incident_id" = 1