app/views/incidents/_form.html.erb

SELECT 1 AS one FROM "services" INNER JOIN "incident_services" ON "services"."id" = "incident_services"."service_id" WHERE "incident_services"."incident_id" = ? AND "services"."id" = ? LIMIT ?  [["incident_id", 980190963], ["id", 298486374], ["LIMIT", 1]]
---
        <label style="display: flex; align-items: center; gap: 0.5rem; cursor: pointer; color: var(--text-primary); font-size: 0.9rem;">
          <input type="checkbox" name="service_ids[]" value="<%= service.id %>" <%= 'checked' if incident.services.include?(service) %> style="accent-color: var(--accent-primary);">