app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."id" ASC LIMIT 1
---
  def set_current_context
    if session[:user_id]
      user = User.find_by(id: session[:user_id])
      if user
        Current.user = user
        Current.organization = user.organization
      end
    end

    # Fallback to first organization for unauthenticated / public access if needed
    Current.organization ||= Organization.first