app/controllers/dashboard_controller.rb

  def index
    @services = current_organization ? current_organization.services.ordered : Service.ordered
    @active_incidents = current_organization ? current_organization.incidents.active : Incident.active
    @recent_incidents = current_organization ? current_organization.incidents.recent.limit(5) : Incident.recent.limit(5)
---
SELECT "services".* FROM "services" INNER JOIN "incident_services" ON "services"."id" = "incident_services"."service_id" WHERE "incident_services"."incident_id" = 1