app/controllers/incidents_controller.rb

  def show
    @incident_updates = @incident.incident_updates.order(created_at: :desc)
---
SELECT "incident_updates".* FROM "incident_updates" WHERE "incident_updates"."incident_id" = ? ORDER BY "incident_updates"."created_at" DESC  [["incident_id", 980190963]]

  def set_incident
    @incident = Incident.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]