app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email]&.downcase&.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@statuspulse.local' LIMIT 1