app/controllers/status_page_controller.rb

  def show
    if params[:org_slug].blank?
      organization = resolve_platform_organization
      raise ActiveRecord::RecordNotFound if organization.nil?

      return redirect_to org_public_status_path(org_slug: organization.slug), status: :moved_permanently
    end

    @organization = Organization.find_by!(slug: params[:org_slug])

    @services = @organization.services.ordered
    @active_incidents = @organization.incidents.active
    @recent_incidents = @organization.incidents.recent.limit(10)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."slug" = 'default' LIMIT 1
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."id" ASC LIMIT 1
SELECT "incidents".* FROM "incidents" WHERE "incidents"."organization_id" = 1 ORDER BY "incidents"."created_at" DESC LIMIT 10