app/models/incident.rb

INSERT INTO "incident_updates" ("incident_id", "status", "body", "created_at", "updated_at") VALUES (1, 'identified', 'We are observing increased replication lag and response latency across read replicas in US-East region.', '2026-08-08 02:19:14.208422', '2026-08-08 02:19:14.208422') RETURNING "id"
---
  def create_initial_update
    incident_updates.create!(
      status: status,
      body: description.presence || "Incident reported. Team is investigating the issue."
    )