app/views/status_page/show.html.erb

        <div class="incident-timeline">
          <% incident.incident_updates.order(created_at: :desc).each do |upd| %>
---
SELECT "incident_updates".* FROM "incident_updates" WHERE "incident_updates"."incident_id" = 1 ORDER BY "incident_updates"."created_at" DESC